Repository: mohammadazar1/tickanddash-reporting-api
Catalog: TickAndDash/TickAndDash/Resources/Controllers/V1/RidersQueueController.*.resx
Languages: ar

# AcceptDriverNotification
source: Your reservation has been Accepted successfully
ar: تم قبول الحجز بنجاح

# AcceptDriverNotificationTitle
source: Accept Reservation
ar: تأكيد الحجز

# AcceptingError
source: The passenger has not Accepted the request
ar: لم يقم الراكب بتاكيد الطلب

# ActiveReservationError
source: Sorry, you currently have an active reservation
ar: عذرًا، لديك حجز فعال حاليًا

# AlreadyAccepted
source: Reservation already accepted!
ar: تم الموافقة على الحجز مسبقًا

# AutomaticSkipMsg
source: Sorry, your booking was automatically postponed
ar: عذرًا، تم تاجيل الحجز بشكل تلقائي

# CancellationError
source: Sorry, you exceeded the cancellation limit!
ar: عذرًا، لقد تجاوزت الحد المسموح به لالغاء الحجز

# GeneralErrorMsg
source: Sorry, something went wrong, please try again later!
ar: عذرًا، حدث خطأ ما يرجى المحاولة لاحقًا!

# NewRiderNotification
source: A new passenger on the passenger list
ar: راكب جديد على قائمة الركّاب

# NewRiderNotificationTitle
source: Passengers List
ar: قائمة الركّاب

# NoActiveReservationError
source: Sorry, you do not currently have an active reservation
ar: عذرًا، ليس لديك حجز فعال حاليًا

# NoBalanceMSg
source: Oops !you do not have enough credit, please recharge your balance
ar: عذرًا ليس لديك رصيد كافٍ لحجز المقعد، يرجى تعبئة الرصيد

# NoDriverInTheQ
source: Sorry, no driver is currently available in the queue
ar: عذرًا، لا يوجد سائق متاح حاليًا

# NoReservations
source: Sorry, there are no bookings right now
ar: عذرًا، لاتوجد حجوزات الآن

# NoTrips
source: Sorry, There is no trips registered for this vehicle
ar: عذرًا، لم تقم المركبة بأي رحلة بعد

# NoTurn
source: Sorry, you need to book first
ar: عذرًا، عليك حجز دور بدايًة

# NotValidDateError
source: Sorry, please enter the date in the suggested format
ar: عذرًا، يرجى ادخال الموعد بالتنسيق المقترح

# NotValidPickup
source: Sorry, you cannot reserve into this pickup station
ar: عذرًا، لا يمكنك حجز دور في هذا الموقف

# NotYourTurn
source: Sorry, it is not your turn now
ar: عذرًا، الدور ليس دورك الآن

# PayingNotificationBody
source: Successfully paid ILS {0}
ar: تم دفع {0} شيكل بنجاح

# QRTripRiderAlreadyPresent
source: Sorry, Your reservation has already been confirmed
ar: عذرًا، تم تأكيد الحجز مسبقًا

# QRTripRiderNotRecognized
source: Sorry We can not recognize you as a passenger on this trip
ar: عذرًا، لا يمكن التعرف عليك ضمن ركاب هذه الرحلة

# ReservationTimeError
source: Sorry, please choose an available time to book
ar: عذرًا، يرجى اختيار وقت متاح للحجز

# SeatLimitError
source: Sorry, you are over the seat limit
ar: عذرًا، لقد تجاوزت الحد المسموح به لعدد المقاعد

# SkipDriverNotification
source: Rider turn has been skipped
ar: قام الراكب بتأحيل حجزه

# SkipDriverNotificationTitle
source: Skiping
ar: تخطي

# SkipError
source: Sorry, there are no {0} passengers with an active reservation behind you
ar: عذرًا، لايتواجد {0} ركاب لديهم حجز فعالك خلفك

# SuccessMsg
source: Your request has been successfully processed
ar: تم معالجة طلبك بنجاح

# WaitYourTurn
source: You have to wait your turn to activate this feature
ar: عليك انتظار دورك لتفعيل هذه الخاصية

# WrongData
source: Sorry, data error
ar: عذرًا، خطأ في البيانات المرسلة
